---
kind: method
id: M:Autodesk.Revit.DB.Macros.ModuleSettings.#ctor(System.String,Autodesk.Revit.DB.Macros.MacroLanguageType)
source: html/41bea620-7ba2-2d6e-64da-39f094e75b9e.htm
---
# Autodesk.Revit.DB.Macros.ModuleSettings.#ctor Method

Constructs a new module settings.

## Syntax (C#)
```csharp
public ModuleSettings(
	string name,
	MacroLanguageType macroLanguageType
)
```

## Parameters
- **name** (`System.String`) - The module name.
- **macroLanguageType** (`Autodesk.Revit.DB.Macros.MacroLanguageType`) - The Macro language type.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration